# RbsParallelconduitsVerticalNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelconduitsVerticalNumber Property
ParameterTypeId Class See Also
---
"Vertical Number for parallel conduits"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelconduitsVerticalNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelconduitsVerticalNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelconduitsVerticalNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace